food-trucks.org
#+title: Food Trucks
#+author: John Shaughnessy

* New things are easy to misunderstand

- They are easy to miss.
- New things might *look* like other things.
- New things might *sound* like other things.
- New things might *seem* like other things.

* Hubs is a new thing

And it's easy to misunderstand.

If I describe its gameplay, you might think it's another "metaverse game" like
- Roblox,
- Rec Room,
- Meta,
- VR Chat.

If I describe its extensibility, you might think it's another game engine like
- Unreal,
- Unity,
- Godot

If I describe its philosophy, you might think it's another
- mastodon / activity pub.
- element / matrix protocol,

No matter where I start, explaining Hubs "directly" is difficult.

So, allow me to take an indirect path.

* Let's forget about Hubs

Let's forget about Hubs for a moment.

Let's forget about
- the metaverse,
- games,
- the immersive web,
- standards,
- artist tools,
- communities,
- tech companies,
- governance, and
- the powerful forces that influence our societies, economies, cultures, and lives.

Let's forget all that.

* Let's talk about food trucks.

Here is a long list of things I want to say about food trucks.

** I love food trucks.

I love eating the food sold by food trucks.

I love discovering new food trucks.

I love the /concept/ of food trucks.

** Food trucks are visually unique

Every food truck has its own paint job.

** Food trucks have unique menus.

Every food truck has its own recipes.

** Food trucks have equipment.

They've got friers and burners and freezers and blenders.

** Food trucks need ingredients.

Bring your own tomatoes - they don't come with the truck.

** Food trucks serve food to patrons.

People eat at food trucks because they love the food, not because they want their own food truck.

** Food trucks are mobile.

They go all over the place.

They go where the people who drive them /want them/ to go.

They go where there are people who love the food.

** Food trucks are small.

Each one is built so that a small number of people can operate one.

** Food trucks are not good at everything.

They are less convenient than home kitchens.

They have less space than restaurant kitchens.

They have only the essential tools for making the menu they sell.

They do not offer substitutions.

They have a small menu.

** Food trucks are designed for their operators.

The capabilities, layout, and organization of the food truck is designed primarily with the operator in mind.

They rarely features that directly benefit patrons of the food truck.

** Food trucks are customized by their operators.

Burger trucks have grills.

Fried chicken trucks have friers.

Smoothie trucks have blenders.

** Food trucks power small businesses.

It's /hard/ to start a business.

It's /expensive/ and /risky/ to start a business.

Food trucks are less expensive than owning a restaurant.

Successful food trucks sometimes graduate into restaurants. Others franchise and expand.

* Hubs are like food trucks

Here is a long list of things I want to say about hubs.

** I love hubs.

I love spending time with people in hubs.

I love discovering new hubs.

I love the /concept/ of hubs.

** Hubs are visually unique.

Every hub has its own UI, color scheme, home screen, and pages.

** Hubs host unique experiences.

Every hub has its own avatars, environments, events, and gameplay.

** Hubs have built-in capabilities.

Hubs have 3D graphics, voice chat, video chat, file storage, and account management.

** Hubs need content.

Bring your own avatars, scenes, and the people you want to play with.

** Hubs entertain and help their visitors.

People visit hubs because they love the experience, not because they want their own hub.

** Hubs are websites.

They're accessible everywhere.

They run on mobile devices, tablets, laptops, gaming computers, and VR/AR headsets.

They're built for the people who love to visit them. Not just for people with high-end computers or game consoles.

** Hubs are small.

Each one is built so that a small number of people can operate one

** Hubs are not good at everything.

They are less convenient than a video call.

They are less extensible than a general purpose game engine.

They have only the essential tools for having a multiplayer experience.

They have preset environments.

They are built to enable specific experiences.

** Hubs are designed for their operators.

The admin panel, permissions, capabilities, layout, and organization of the hub is designed primarily with the operator in mind.

** Hubs power small creative businesses.

It's /hard/ to start a creative business.

It's /expensive/ and /risky/ to start a creative business.

Building with Hubs is less expensive than building with other game engines.

We expect successful Hubs to sometimes graduate into a unique immersive application or service. Others will replicate their Hub with variations and expand with servers in new regions.

* Why Hubs is a new thing

Now we can see why.

