food-trucks.md


<a id="org26ba73d"></a>

## Hubs aren&rsquo;t like other &ldquo;metaverse games&rdquo;

Consider Roblox, Rec Room, Meta, and VR Chat. These are not food trucks.

They&rsquo;re all&#x2026; RESTAURANTS!

But imagine how bad it feels to be a chef at such a restaurant&#x2026;

As a chef, you don&rsquo;t work for the restaurant.

You&rsquo;re just a patron who likes cooking.

The restaurant supplies a limited set of ingredients.

You must not stray too far from the pre-approved menu.

If the restaurant dislikes you or your food, they&rsquo;ll kick you out.

If the restaurant loves your food, they will sell it for a profit. If you&rsquo;re lucky, they might let you have some of that money. But more than likely all you&rsquo;ll earn is some monopoly money.

You can&rsquo;t take your recipes with you to start your own restaurant. Those recipes &#x2013; all your hard work &#x2013; all the meals you&rsquo;ve prepared and served&#x2026; Those are the property of the restaurant.

The restaurant boasts an impressively large menu of user-generated content. The snowball starts to roll. Soon enough everyone is eating most of their meals at this restaurant.

I don&rsquo;t mean to suggest that the restaurant does not deserve some compensation for their work. After all, they provide valuable services and equipment. They maintained the kitchen and cleaned the tables and welcomed the guests and payed the property taxes. That effort is certainly worth rewarding.

The problem, though, is that when one of these restaurants gets popular, they franchise all over the world, and the balance of power is extremely in the restaurant&rsquo;s favor. Individual chefs, who provided the creative spark, who brought their friends to the restaurant, who put up with the day the friers broke and the blender exploded&#x2026; Those chefs are left out in the cold, burning their monopoly money for warmth.


<a id="orgac4561c"></a>

## The Hubs engine is not another general purpose game engine

Consider Unreal Engine and Godot. These are not food trucks.

They&rsquo;re much more versatile than that. And consequently, much more complicated.

You can build practically anything with them: buildings, vehicles, bridges, space elevators. There is nothing particularly food-trucky about them.

But let&rsquo;s imagine that we want a food truck, and we choose one of these engines as our starting point.


<a id="org7cedeb5"></a>

### **Unreal engine** is a world-class commercial kitchen.

It&rsquo;s got 11 sinks, 400 pots & pans of all shapes and sizes, ceiling-mounted vents, 6 dish washers, and state-of-the-art high-precision induction burners for heating salmon to exactly 122°F before a flash-in-the-pan sear.

It takes a team of 40 experienced chefs to operate effectively and really shines when the team grows beyond 100 people.

Unreal engine is *extremely good* for what it&rsquo;s good at: Allowing a team of trained professionals create one-of-a-kind, AAA dining experiences.

But it is exactly the wrong tool for a pair of chefs who are excited to share their favorite spicy fried chicken recipe.


<a id="orgff03416"></a>

### **Godot** is like a build-your-own-auto manufacturer.

Godot is much more approachable than Unreal Engine. It also feels more light weight and mobile. The batteries are included, and they&rsquo;ve designed the application from the ground-up to be easier to learn for artists, level designers, animators, and everyone in between.

With Godot, you can make all sorts of vehicles. You can make a racecar, a school bus, a tank, a plane, a submarine, a motorcycle, a bicycle.

You can choose the wheels you want. And the engine. And the body. And whether it has jet packs. And whether it&rsquo;s actually a talking cat-bus a la My Neighbor Totoro. <https://en.wikipedia.org/wiki/Catbus>

In theory, you could build a food truck with Godot. But if what you wanted spend your time doing was perfecting your fish taco recipe, Godot is not the right tool for you.


<a id="org72e361e"></a>

## Hubs is mission-driven

Consider Mastodon or the Matrix.org Foundation. These mission-driven organizations each have a vision for decentralized, secure, private, unencumbered and global communication.

Matrix.org and Mastodon have different approaches to decentralization and product development.

Chat clients like Element communicate via the Matrix protocol. Mastodon servers communicate via the Activity pub protocol.

The goals of each are noble and their strategies for achieving them are viable. I hope they succeed.

At risk of stretching the analogy too thin, let&rsquo;s keep talking about food trucks.


<a id="org8e679fc"></a>

### Food trucks need parking and business permits.

Food trucks aren&rsquo;t allowed to park just anywhere. Local laws still apply.

It&rsquo;s important that a society create fair and transparent rules about who is allowed to do what.

A food truck is not allowed to park in front of a fire hydrant no matter how delicious the noodles it serves is. It puts everyone else at unacceptable risk &#x2013; especially if the noodles are spicy enough to be deemed a fire hazard!


<a id="org614a7f0"></a>

### Food trucks must meet food safety standards.

Food truck operators must not serve food that has been poisoned, contaminated, and spoiled. Beyond the reputational harm they&rsquo;d do to themselves and the gastrointestinal harm they&rsquo;d do to their patrons, they might also be held legally responsible if found negligent.


<a id="org9973bad"></a>

### Food trucks have socio-political consequences

Like any business, food trucks are subject to regulations, taxes, and inspections decided by political processes of the jurisdictions where they operate.

Those political processes invite fundamental issues of ethics, morality, access, representation, and governance. Food truck operators, their patrons, and the communities that host them all influence those political processes.


<a id="org20fb229"></a>

### Let&rsquo;s get back to Hubs, Mastodon, and Matrix.

Hubs has not published or implemented a particular protocol. While there is demand for an identity and asset management service that lives outside of each hub instance, we have not built such a product, service, or protocol.

Hubs today is an enabling technology. It is a seed we plant with the dream of a beautiful future. We will not achieve a beautiful future alone.

With Hubs, &ldquo;we aim to create the most joyful online social experiences by bringing the best of real world interactions to the open web&rdquo;.

If we succeed, then many chefs will operate many food trucks. We will have avoided a future where chefs are exploited or patrons aren&rsquo;t free to support the chefs they like most. We will have empowered creators and rewarded those who have added value (rather than extracting that value for ourselves alone).


<a id="org775813c"></a>

### Making money is not the end goal.

Consider Mozilla&rsquo;s mission:

> Our mission is to ensure the Internet is a global public resource, open and accessible to all. An Internet that truly puts people first, where individuals can shape their own experience and are empowered, safe and independent.

Whatever you want to call it &#x2013; the &ldquo;metaverse&rdquo;, the immersive web, or just &ldquo;video games&rdquo; &#x2013; people are increasingly gathering in multiplayer experiences to create, connect, play, learn and express themselves.

These applications have *massive* socio-political consequences. These applications know who you spend time with, what you talk about, where you look, for how long, and whether your pupils dilated ever so slightly. They have unprecedented access to YOU. It doesn&rsquo;t have to be this way. I want to live in a future where I can experience the immersive web and feel confident I&rsquo;m not being recorded, tracked, manipulated, and exploited by unseen actors.

Notice that there are hardly any &ldquo;food safety standards&rdquo; for these applications.

We believe that with Hubs, we have an opportunity to avoid this family of applications from falling into the same centralized, exploitative, and dangerous patterns of social media companies today.
