food-trucks.md


<a id="org0b9f699"></a>

### We still want to make money

We still hope to create a sustainable business around Hubs.

The business model of social media companies has been to harvest, analyze, exploit, and sell user data. This creates an asynchronous power dynamic between platforms and a platforms users.

By creating valuable products people pay for, we sustain the mission and maintain a direct relationship with the people we serve. (With Hubs, you are *not* the product.)


<a id="org0d24b2e"></a>

# What people pay us for

Surely there&rsquo;s nothing more to say about food trucks

Oh but of course there is.

In the previous section, I talked about making money. This is how we do that, and why everyone gets to feel good about how we&rsquo;re doing it.

Hubs (aka &ldquo;hub instances&rdquo;) come in a variety of flavors.


<a id="org2ed4172"></a>

## Hubs Cloud

Hubs Cloud is our &ldquo;self-hosted&rdquo; option. You pay a convenience fee to Mozilla and hosting fees to the cloud provider of your choice to own and operate your own Hub. This is like buying your own food truck.

There are some advantages to having your own hub *completely*. It gives you ultimate flexibility and control. You can run it side-by-side with other cloud services you own and operate. It is absolutely the best choice for some customers.

Most people don&rsquo;t want or need this level of control. It is akin for being responsible for all the maintenance of the food truck. Burner broke? You fix it. Flat tire? Deal with it yourself. You want a new freezer to store berries and icecream? Install it yourself.

Cost is also a considerable downside. Reserving dedicated services from cloud providers does not need to be prohibitively expensive, but most people still prefer a less expensive option, even if it means sharing servers. Most of all, many people prefer predictable pricing. They don&rsquo;t want to calculate and project and analyze their bills every month.


<a id="org413ac74"></a>

## Managed Hubs

Recently, we launched an &ldquo;early access&rdquo; program for Hubs.

Effectively, it lets people rent a food truck. We fix the tires. We upgrade the fridge. We keep your servers humming happily so that you can think about fish tacos and building escape-the-room games.

This is a product I have dreamt about for a long time:

I visit a website, pay some monthly fee, get my own multiplayer game (that I can completely customize, from the color scheme to the content to the code), run it on my own website, where I can commercialize it directly to end users.

This to me is mind blowing. And I hope it&rsquo;s as exciting to creative people around the world as it is to me. There are plenty of rough edges we need to iron out, but the essential pieces are all there.


<a id="org685ab97"></a>

# Where to focus


<a id="org06ec874"></a>

## Where a food truck company focuses

As a company that designs, manufactures, maintains, sells and rents out food trucks, we are part of something much bigger than ourselves.

A food truck company doesn&rsquo;t invent recipes.

It doesn&rsquo;t procure ingredients.

It doesn&rsquo;t create point-of-sale systems.

It doesn&rsquo;t create apps, ads, or promotions for particular truck owners.

It doesn&rsquo;t try to make the best falafel.

It doesn&rsquo;t create cooking tutorials or offer cooking classes.

It doesn&rsquo;t write the laws of the road, decide where to park, or determine what permits food truck operators need.

Its role is to provide high-quality, fit-to-purpose vehicles that meet the needs of their customers, the chefs.

A food truck company needs an ecosystem in which it can embed itself.

It needs chefs who want autonomy and flexibility.

It needs patrons who enjoy trying new cuisines from non-traditional restaurants.

It needs a society whose laws ensure that chefs can run businesses and patrons can eat safely.

It needs expertise in auto manufacturing, interior design, and yes &#x2013; even cooking, though their best feedback will be from their chefs.


<a id="org3fb8bed"></a>

## Where we must focus

We have and hear so many exciting ideas about Hubs.

It&rsquo;s difficult to know what to focus on.

Most of us are not just in love with food trucks.

-   We&rsquo;re in love with food.
-   We&rsquo;re in love with cooking and with eating.
-   We love the people who eat.
-   We love the people who cook.
-   We care about the laws and the rules and the norms and the culture surrounding food trucks.
-   We love to dream about the future of food trucks. The future of vehicles. And the future of food.

For the ecosystem to succeed, we must provide reliable, high-quality, well-designed, well-maintained food trucks.

If we can do *more* than that, that&rsquo;s great. But we aren&rsquo;t doing that basic piece well yet.

If we try to build food trucks *and also do other things*, then we are splitting focus, and we&rsquo;ll get less far.

Taking this route is a calculated risk. By focusing on building the best food trucks we can, we assume:

-   Chefs will bring their expertise to craft wonderful menu items.
-   Point-of-sale systems will be created to facilitate and ease transactions.
-   Farmers and wholesalers will provide ingredients to chefs.
-   Politicians and community representatives will discuss regulations and safety.
-   Customers will eat food.
-   We&rsquo;ll dream about the future together.

Of course, there may be things outside of our core focus to stimulate the ecosystem, jump-start a virtuous cycle, or engage a flywheel effect.

But we should be wary not to confuse our role with someone else&rsquo;s, or split our efforts too widely. Just as the entire ecosystem cannot thrive without skilled chefs, neither can it thrive without well-built food trucks.

As food truck manufacturers, we will have a seat at the table - but not authoritative control - over the standards and laws that govern the next wave of interactive computing. This is as it should be. These standards and laws will effect all of us. All of us together should write them.


<a id="org490038f"></a>

# Appendix

There are some corrections to make.


<a id="org9cbe9e9"></a>

## Hubs are also designed for their visitors

Above, I claimed that Hubs are designed primarily for their operators.

That&rsquo;s only partially true.

Unlike food trucks whose patrons already know how to eat, visitors to a Hub *do not* already know how to navigate them.

The way we overcome this challenge is by teaching people how to navigate and also copying common design patterns in 3D games that visitors are likely to have encountered from their other experiences.

Ideally, hubs appeal to an even wider audience than games historically have. There&rsquo;s reason to believe this is true: The raw capabilities are a superset of games, video calls, and most social media apps.

This means we should expect to spend unusually high effort on teaching and offering simpler alternatives to navigation than most games need to.

In many ways, I expect hubs to appeal to people who *don&rsquo;t* particularly like games. People who like games have thousands of distinct experiences to choose from. Multiplayer, single player, competitive, casual. For people who like connecting with others, expressing themselves, and building things to share &#x2013; Hubs offers new ways of doing that.


<a id="org3048a46"></a>

## Hubs do need to provide some ingredients

Above, I mentioned that food trucks don&rsquo;t provide ingredients and hub instances don&rsquo;t provide content like avatars and environments. This is not quite true. We believe that people need high-quality default content. We also think that content should stay fresh, and it should be easy to find more of what you&rsquo;re looking for and enjoy.

I think we are in an uncomfortable middle ground right now with content. It seems like it&rsquo;s not *quite* right that it always lives within a Hub instance. And it&rsquo;s not *quite* right that we provide it. Sketchfab seemed like a critical part of the overall vision for an immersive web that rewards creators. Now that Sketchfab is owned by Epic Games, I&rsquo;m not so sure anymore.
